;rk2.lisp

;Даны:

; смешанный структурированный список 
;(т.е. любой элемент списка может быть: символ, число или список),
;множество, в виде смешанного одноуровневого 
;( т.е. не структурированного) списка.
; На всех уровнях заданного списка найти количество элементов,
; принадлежащих заданному множеству.
; Заменить К-ый элемент верхнего уровня исходного списка на 
; найденное значение или дописать это значение в конец исходного списка.

; *Отсортировать заданное множество по возрастанию (для max-х баллов).